git
vim
tmux
zsh
wget
curl
htop
tree
jq
fzf
ripgrep
fd-find
bat
exa
thefuck
tldr
python3
python3-pip
python3-venv
nodejs
npm
golang
rustc
cargo
ruby
ruby-dev
openjdk-17-jdk
docker.io
docker-compose
kubectl
terraform
awscli
azure-cli
google-cloud-sdk
build-essential
cmake
pkg-config
libssl-dev
libffi-dev
xclip
fonts-firacode
fonts-jetbrains-mono
fonts-hack-ttf 